set foreign_key_checks = 0;

INSERT INTO `detailSubjects` VALUES
('물리1','과탐'),
('물리2','과탐'),
('생물1','과탐'),
('생물2','과탐'),
('지구과학1','과탐'),
('지구과학2','과탐'),
('통합과학','과탐'),
('화학1','과탐'),
('화학2','과탐'),
('국어','국어'),
('언어와 매체','국어'),
('화법과 작문','국어'),
('통합사회','사탐'),
('생활과 윤리','사탐'),
('윤리와 사상','사탐'),
('한국지리','사탐'),
('세계지리','사탐'),
('동아시아사','사탐'),
('세계사','사탐'),
('경제','사탐'),
('정치와 법','사탐'),
('사회·문화','사탐'),
('수학','수학'),
('확률과 통계','수학'),
('미적분','수학'),
('기하','수학'),
('영어','영어');
INSERT INTO `email-code` VALUES
('test@test.com',123456,0);
INSERT INTO `exam` VALUES
(1,'2022 3월모의고사','2022-03-24','48,46,40,36,30,32,30,28','물리1',3),
(2,'2022 6월모의고사','2022-06-12','48,42,40,36,30,32,30,28','물리1',3);
INSERT INTO `record` VALUES
(1,1,'물리1',1,43),
(2,1,'물리1',2,43);
INSERT INTO `student` VALUES
(1,'홍길동',1,3,'물리1','그레잇고교',2022);
INSERT INTO `subjects` VALUES
('과탐'),
('국어'),
('사탐'),
('수학'),
('영어');
INSERT INTO `teacher` VALUES
(1,'test@test.com','과탐','진짜선생님1','2bbe7e30ee79bfed40109dbce86945cc6ca636125c11553e7b705b90033cf2bf');
set foreign_key_checks = 1;